# FabricRoundingManager Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricRoundingManager Class
Members See Also
---
Provides access to element reinforcement roundings overrides.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class FabricRoundingManager : ReinforcementRoundingManager
```

Visual Basic
---
```text
Public Class FabricRoundingManager _
	Inherits ReinforcementRoundingManager
```

Visual C++
---
```text
public ref class FabricRoundingManager : public ReinforcementRoundingManager
```

# Remarks
An instance of this class can be obtained from specific FabricSheetType or individual FabricSheet or FabricArea elements to apply overrides different from the global settings for the project.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..ReinforcementRoundingManager Autodesk.Revit.DB.Structure..::..FabricRoundingManager
# See Also
FabricRoundingManager Members
Autodesk.Revit.DB.Structure Namespace